In [28]:
import numpy as np 
import pandas as pd
nba = pd.read_csv('nba.csv')
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
nba['Team'].nunique()

30

In [30]:
nba.Position.value_counts()

Position
SG    102
PF    100
PG     92
SF     85
C      78
Name: count, dtype: int64

In [31]:
nba.College.nunique()

118

In [32]:
nba.Salary.nunique()

309

In [33]:
nba.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [34]:
nba.drop('Name',axis=1,inplace=True)

In [35]:
nba.drop(columns=['College', 'Team','Position','Number'], inplace=True)

In [36]:
nba['Height'].value_counts()

Height
6-9     59
6-10    47
6-7     45
6-8     43
6-6     42
6-11    40
6-3     33
6-5     32
6-4     29
7-0     27
6-1     16
6-2     16
6-0     10
7-1      7
7-3      4
5-11     3
7-2      3
5-9      1
Name: count, dtype: int64

In [37]:
nba['Height'] = nba['Height'].str.replace('-','.')

In [42]:
nba['Height'] = nba['Height'].astype('float64')

In [43]:
nba

      Age  Height  Weight     Salary
0    25.0     6.2   180.0  7730337.0
1    25.0     6.6   235.0  6796117.0
2    27.0     6.5   205.0        NaN
3    22.0     6.5   185.0  1148640.0
4    29.0     6.1   231.0  5000000.0
..    ...     ...     ...        ...
453  26.0     6.3   203.0  2433333.0
454  24.0     6.1   179.0   900000.0
455  26.0     7.3   256.0  2900000.0
456  26.0     7.0   231.0   947276.0
457   NaN     NaN     NaN        NaN

[458 rows x 4 columns]

In [44]:
y = nba['Salary']
x = nba.drop('Salary', axis=1)